app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
---
  def index
    if current_user.has_role?(:employee) || current_user.has_role?(:admin)
      @reservation = Reservation.all

INSERT INTO "reservations" ("client_demands", "created_at", "end_date", "start_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @reservation = build_reservation params[:reservation]

    if @reservation.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def set_user  #temp
    id = params[:user_id]

    if (id != nil)
      @user = User.find(params[:user_id])