app/controllers/rooms_controller.rb

  def index
    @room = Room.all
---
SELECT "rooms".* FROM "rooms"

  def create
    @room = Room.new(params[:room])
    if @room.save
---
INSERT INTO "rooms" ("created_at", "floor_no", "room_no", "type_id", "updated_at", "view_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 11 Jan 2019 19:28:31 UTC +00:00], ["floor_no", 1], ["room_no", 5], ["type_id", 2], ["updated_at", Fri, 11 Jan 2019 19:28:31 UTC +00:00], ["view_id", 1]]